cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "d12frosted/emacs-plus"

brew "bash-completion"
brew "coreutils"
brew "d12frosted/emacs-plus/emacs-plus", args: ["HEAD", "with-emacs-27-branch", "without-spacemacs-icon"]
brew "fd"
brew "markdown"
brew "mas"
brew "neovim"
brew "node"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "tmux"
brew "vim"

cask "alacritty"
cask "docker"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "racket-cs"

mas "1Password 7", id: 1333542190
mas "Bear", id: 1091189122
mas "Haskell", id: 841285201
mas "Telegram", id: 747648890

